### STEP ONE: Import pandas

In [1]:
import pandas as pd

### Core objects in pandas
    - Series (column)
    - Data frame (multi-dimensional table made up of a collection of Series)

#### 1. DataFrame
* A dataframe is a table that contains individual entries, each of a certain value (A collection of data series)
* A dataframe potentially contains heterogeneous (varied/diverse) tabular structure which contains 2 axes ie rows and columns
* Principal components of pandas DataFrames are DATA, ROWS and COLUMNS

In [3]:
# Example 1: Create a dataframe using a list

myNames = ["Bernard", "Ian", "Ernest", "Immaculate", "Michael"]

# To create a dataframe, call the DataFrame constructor

df = pd.DataFrame(myNames)

df

            0
0     Bernard
1         Ian
2      Ernest
3  Immaculate
4     Michael

In [4]:
studentInfo = [["Ian", "Muyumba", "Mandela"],[24,25,26]]

studentInfodf = pd.DataFrame(studentInfo)

studentInfodf

     0        1        2
0  Ian  Muyumba  Mandela
1   24       25       26

In [5]:
# Example 2: Creating a DataFrame from a dictionary of lists which must have the same length.
#Assume that you want to represent some votes ie YES or NO

pd.DataFrame({"YES" : [100,200,300,400], "NO" : [500,600,700,800]})

   YES   NO
0  100  500
1  200  600
2  300  700
3  400  800

In [7]:
# Example 3: Create a DataFrame to represent names of four students and their ages

pd.DataFrame({
    "Student" : ["Ian", "Bernard", "Ernest", "Immaculate"],
    "Ages" : [21,22,23,24]})

      Student  Ages
0         Ian    21
1     Bernard    22
2      Ernest    23
3  Immaculate    24

In [8]:
# Method 2

myStudentInfo = {"Student" : ["Ian", "Bernard", "Ernest", "Immaculate"], "Ages" : [21,22,23,24]}

pd.DataFrame(myStudentInfo)

      Student  Ages
0         Ian    21
1     Bernard    22
2      Ernest    23
3  Immaculate    24

In [9]:
# Example 4: Defining our Index

reviews = {
    "Ian" : ["Liked it", "Not Bad"],
    "Bernard" : ["Very Terrible", "Could do better"]
}

pd.DataFrame(reviews, index = ["A","B"])

        Ian          Bernard
A  Liked it    Very Terrible
B   Not Bad  Could do better

In [11]:
# Option 2: Hide Index

# pd.DataFrame(reviews, index = False)

In [17]:
"""
    Example 5:
        1. Define a dictionary containing employee data. It should contain the name, age, address,
        qualification (BSc, MSc,Phd)
        2. Create a DataFrame
        3. Column Selection

"""

employeeRecords = {
    "Name" : ["Joan", "Jane", "Peter", "Mark"],
    "Age" : [34,35,36,37],
    "Gender" : ["F","F","M","M"],
    "Address" : ["Kisumu", "Nairobi", "Mombasa", "Eldoret"],
    "Qualification" : ["MSc", "BSc", "MSc", "PDd"]
}

employeeDF = pd.DataFrame(employeeRecords)
employeeDF

    Name  Age Gender  Address Qualification
0   Joan   34      F   Kisumu           MSc
1   Jane   35      F  Nairobi           BSc
2  Peter   36      M  Mombasa           MSc
3   Mark   37      M  Eldoret           PDd

In [19]:
# To select a column in pandas, we can call out their name

employeeDF["Name"]

0     Joan
1     Jane
2    Peter
3     Mark
Name: Name, dtype: object

In [22]:
# Select multiple columns

employeeQualification = employeeDF[["Name","Qualification"]]
employeeQualification

    Name Qualification
0   Joan           MSc
1   Jane           BSc
2  Peter           MSc
3   Mark           PDd

In [24]:
# Get the sum of a column

sumAges = employeeDF["Age"]
sumAges.sum(axis=0)

142

In [27]:
# Row Selection - You can retrieve rows from a DataFrame using .loc[]

row2 = employeeDF.loc[1]
row2

Name                Jane
Age                   35
Gender                 F
Address          Nairobi
Qualification        BSc
Name: 1, dtype: object

In [28]:
# Read from a CSV file

#### Series

    * A Series is a one-dimensional labeled array that holds data of any type (int,float,string,object)